/* iPadcontroller page success */
"### Congratulations!** You created a drone controller using code!!!!!\n\n" = "### Félicitations !** Tu as programmé une télécommande pour ton drone en Swift !!!!!\n\n";

/* iPadcontroller page success */
"### Congratulations!** You managed to understand how the iPad accelerometer works! Now it is time to create a drone remote control using code!!!!!\n\n[**Next Page**](@next)" = "### Félicitations!** Tu as réussi à contrôler ton drone avec ton iPad! Maintenant il est temps de programmer une télécommande en Swift !\n\n[**Next Page**](@next)";

/* camera page success */
"### Congratulations! You know how to control the camera!\n\n[**Next Page**](@next)" = "### Félicitations ! Tu sais contrôler la caméra !\n\n[**Page Suivante**](@next)";

/* grabber page success */
"### Congratulations! You know how to control the grabber!\n\n[**Next Page**](@next)" = "### Félicitations ! Tu sais contrôler la pince \n\n[**Page Suivante**](@next)";

/* challenge1 page success */
"### Congratulations!\nYou achieved your first mission!\n\n[**Next Page**](@next)" = "### Félicitations !\n Tu as réussi ta première mission !\n\n[**Page Suivante**](@next)";

/* challenge2 page success */
"### Congratulations!\nYou achieved your second mission!\n\n[**Next Page**](@next)" = "### Félicitations !\n Tu as réussi ta seconde mission !\n\n[**Page Suivante**](@next)";

/* advancedflightplan page success */
"### Congratulations!\nYou created your first complex flight plan!\n\n[**Next Page**](@next)" = "### Félicitations !\n Tu as crée ton premier plan de vol complexe !\n\n[**Page Suivante**](@next)";

/* Speed page success */
"### Congratulations!\nYou know how to change the speed of your drone!\n\n[**Next Page**](@next)" = "### Félicitations !\n Tu sais modifier la vitesse de ton drone !\n\n[**Page Suivante**](@next)";

/* UpDown page success */
"### Congratulations!\nYou know how to control gaz on your drone!\n\n[**Next Page**](@next)" = "### Félicitations !\n Tu sais contrôler l'altitude de ton drone !\n\n[**Page Suivante**](@next)";

/* complexmove page success */
"### Congratulations!\nYou know how to use the complex move command!\n\n[**Next Page**](@next)" = "### Félicitations !\n Tu sais utiliser la commande de mouvement complexe !\n\n[**Page Suivante**](@next)";

/* conditionalmove page success */
"### Congratulations!\nYou know how to use the conditional move command!\n\n[**Next Page**](@next)" = "### Félicitations !\n Tu sais utiliser la fonction de mouvement conditionnel !\n\n[**Page Suivante**](@next)";

/* ForwardBackward page success */
"### Congratulations!\nYou know how to use the pitch command!\n\n[**Next Page**](@next)" = "### Félicitations !\n Tu sais utiliser la commande de pitch !\n\n[**Page Suivante**](@next)";

/* LeftRight page success */
"### Congratulations!\nYou know how to use the roll command!\n\n[**Next Page**](@next)" = "### Félicitations !\n Tu sais utiliser la commande de roll !\n\n[**Page Suivante**](@next)";

/* Rotate page success */
"### Congratulations!\nYou know how to use the yaw command!\n\n[**Next Page**](@next)" = "### Félicitations !\n Tu sais utiliser la commande de yaw !\n\n[**Page Suivante**](@next)";

/* complexchallenge success */
"### Congratulations!\nYou made your first advanced mission!\n\n[**Next Page**](@next)" = "### Félicitations !\n Tu as réussi ta première mission avancée !\n\n[**Page Suivante**](@next)";

/* TakeoffLand page success */
"### Congratulations!\nYou made your first flight!\n\n[**Next Page**](@next)" = "### Félicitations !\n Tu as réussi ton premier vol !\n\n[**Page Suivante**](@next)";

/* Flip page success */
"### Congratulations!\nYou made your first flip!\n\n[**Next Page**](@next)" = "### Félicitations !\n Tu as réussi ta première acrobatie !\n\n[**Page Suivante**](@next)";

/* Drone icon accessibility */
"Airborne Cargo Mars drone" = "Drone Airborne Cargo Mars";

/* Drone icon accessibility */
"Airborne Cargo Travis Drone" = "Drone Airborne Cargo Travis";

/* Drone icon accessibility */
"Airborne Night Blaze Drone" = "Drone Airborne Night Blaze";

/* Drone icon accessibility */
"Airborne Night Maclane Drone" = "Drone Airborne Night Maclane";

/* Drone icon accessibility */
"Airborne Night Swat Drone" = "Drone Airborne Night Swat";

/* flip(.back) command */
"Back Flip" = "Pirouette arrière";

/* error */
"Battery level too low to Flip" = "Niveau de batterie trop faible";

/* last challenge hint */
"Be sure to include 3 simple moves and 1 complex move." = "Utilise 3 mouvements simples et 1 mouvement complexe.";

/* error */
"Cannon not attached" = "Canon non attaché";

/* closeGrabber() command */
"Close Grabber" = "Ferme la pince";

/* bt connect title */
"Connect Drone" = "Connecte ton Drone";

/* bt connect title */
"Connect to a Different Drone" = "Connecte un autre Drone";

/* bt connect title */
"Connecting Drone" = "Connexion en cours ";

/* fireCannon() command */
"Fire Cannon" = "Pan !";

/* move(.forward) hint1 */
"First you will move forward using `move(direction: MoveDirection.forward, duration: 1)`." = "Commence par avancer en utilisant `move(direction: MoveDirection.forward, duration: 1)`.";

/* move(.left) hint1 */
"First you will move left using `move(direction: MoveDirection.left, duration: 1)`." = "Commence par te déplacer vers la gauche en utilisant `move(direction: MoveDirection.left, duration: 1)`.";

/* move(.up) hint1 */
"First you will move up using `move(direction: MoveDirection.up, duration: 1)`." = "Commence par te déplacer vers la haut en utilisant `move(direction: MoveDirection.up, duration: 1)`.";

/* turn(.right) hint1 */
"First you will turn clockwise using `turn(direction: TurnDirection.right, angle: 180)`." = "Commence par tourner dans le sens horaire en utilisant `turn(direction: TurnDirection.right, angle: 180)`.";

/* Flying state accessibility */
"Flying" = "En vol";

/* flip(.front) command */
"Front Flip" = "Pirouette avant";

/* error */
"Grabber not attached" = "Pince non branchée";

/* Flying state accessibility
   Landed command text */
"Landed" = "Au sol";

/* Flying state accessibility */
"Landing" = "En train d'atterrir";

/* flip(.left) command */
"Left Flip" = "Pirouette gauche";

/* Drone icon accessibility */
"Mambo drone" = "Drone Mambo";

/* Drone icon accessibility */
"Mambo drone with cannon accessory" = "Drone Mambo avec le canon";

/* Drone icon accessibility */
"Mambo drone with grabber accessory" = "Drone Mambo avec la pince";

/* move(pitch:roll:gaz:yaw:) command */
"Move" = "Déplacement";

/* move(.backward) command */
"Move Backward" = "Déplacement vers l'arrière";

/* move(.down) command */
"Move Down" = "Déplacement vers le bas";

/* move(.froward) command */
"Move Forward" = "Déplacement vers l'avant";

/* move(.left) command */
"Move left" = "Déplacement vers la gauche";

/* move(.right) command */
"Move Right" = "Déplacement vers la droite";

/* move(.up) command */
"Move Up" = "Déplacement vers le haut";

/* openGrabber() command */
"Open Grabber" = "Ouvre la pince";

/* flip(.right) command */
"Right Flip" = "Pirouette droite";

/* Drone icon accessibility */
"Rolling Spider Drone" = "Drone Rolling Spider";

/* bt connect title */
"Searching for Drone" = "Recherche un Drone";

/* bt connect title */
"Select a Drone" = "Sélectionne un Drone";

/* takePicture() command */
"Take Picture" = "Prends une photo";

/* Flying state accessibility */
"Taking-off" = "Décollage";

/* move(.forward) hint2 */
"Then you will move backward using `move(direction: MoveDirection.backward, duration: 1)`." = "Déplace-toi ensuite vers l'arrière avec `move(direction: MoveDirection.backward, duration: 1)`.";

/* move(.up) hint2 */
"Then you will move down using `move(direction: MoveDirection.down, duration: 1)`." = "Déplace-toi ensuite vers le bas avec `move(direction: MoveDirection.down, duration: 1)`.";

/* move(.left) hint2 */
"Then you will move right using `move(direction: MoveDirection.right, duration: 1)`." = "Déplace-toi ensuite vers la droite avec `move(direction: MoveDirection.right, duration: 1)`.";

/* turn(.right) hint2 */
"Then you will turn counterclockwise using `turn(direction: TurnDirection.left, angle: 180`." = "Tourne ensuite dans le sens anti-horaire avec `turn(direction: TurnDirection.left, angle: 180`.";

/* grabber hint */
"To control the grabber, you need to use: `openGrabber()`and `closeGrabber()`." = "Pour contrôler la pince, utilise `openGrabber()` et `closeGrabber()`.";

/* flip(.front) hint */
"To make a front flip, you need to use: `flip(direction: FlipDirection.front)`" = "Pour faire une pirouette avant, utilise `flip(direction: FlipDirection.front)`";

/* takeOff hint */
"To take off you need to use the `takeOff()` command." = "Pour décoller, utilise la commande `takeOff()`.";

/* camera hint */
"To trigger the camera, you need to use `takePicture()`." = "Pour déclencher la caméra, utilise `takePicture()`.";

/* firmware update instructions */
"To update your drone, please visit [this link](https://www.parrot.com/support)" = "Pour mettre ton drone à jour, rends toi sur sur [ce lien](https://www.parrot.com/support)";

/* Twister down hint */
"Try `move(pitch: 0, roll: 0, gaz: -20, yaw: 100, duration: 3)` command to move down and rotate at the same time." = "Essaie la commande `move(pitch: 0, roll: 0, gaz: -20, yaw: 100, duration: 3)` pour se déplacer vers le haut et tourner en même temps.";

/* Twister up hint */
"Try `move(pitch: 0, roll: 0, gaz: 20, yaw: 100, duration: 3)` command to move up and rotate at the same time." = "Essaie la commande `move(pitch: 0, roll: 0, gaz: 20, yaw: 100, duration: 3)` pour se déplacer vers le bas et tourner en même temps.";

/* complex move hint */
"Try the command `move(pitch:20, roll:20, gaz:10, yaw:80, duration:2)`" = "Essaie la commande `move(pitch:20, roll:20, gaz:10, yaw:80, duration:2)`";

/* horizontal square hint1 */
"Try to move and turn by 90° four time" = "Essaie d'avancer et de tourner de 90° quatre fois";

/* turn(.left) command */
"Turn Left" = "Tourne vers la gauche";

/* turn(.right) command */
"Turn Right" = "Tourne vers la droite";

/* droneSpeed hint */
"Use `droneSpeed = value<0..100>` to change the drone speed." = "Utilise `droneSpeed = value<0..100>` pour modifier la vitesse du drone.";

/* move(.backward) hint */
"Use `move(direction: MoveDirection.backward, duration: 1)` to move backward." = "Utilise `move(direction: MoveDirection.backward, duration: 1)` pour te déplacer vers l'avant.";

/* move(.down) hint */
"Use `move(direction: MoveDirection.down, duration: 1)` to move down." = "Utilise `move(direction: MoveDirection.down, duration: 1)` pour te déplacer vers le bas.";

/* move(.right) hint */
"Use `move(direction: MoveDirection.right, duration: 1)` to move right." = "Utilise `move(direction: MoveDirection.right, duration: 1)` pour te déplacer vers la droite.";

/* turn(.left) hint */
"Use `turn(direction TurnDirection.left, angle: 180)` to turn counterclockwise." = "Utilise `turn(direction TurnDirection.left, angle: 180)` pour tourner dans le sens anti-horaire.";

/* vertical square hint */
"You must move in all 4 directions (up, left, down, right)." = "Tu dois te déplacer dans les 4 directions (up, left, down, right).";

